app/Controllers/Cfit.php

SELECT *
FROM `test`
WHERE `id_user` = '7'
SELECT `soal`.`id_soal`, `soal`.`isi_soal`, `soal_ujian`.`id_soal_ujian`, `soal_ujian`.`jawaban_soal_ujian`
FROM `soal_ujian`
JOIN `soal` ON `soal_ujian`.`id_soal` = `soal`.`id_soal`
WHERE `soal_ujian`.`id_test` = '2'
AND  `soal`.`isi_soal` LIKE 'bag1_%' ESCAPE '!'
AND `soal`.`isi_soal` NOT IN ('bag1_contoh soal.png','bag2_contoh soal.png','bag3_contoh soal.png','bag4_contoh soal.png')
---
    public function test($hashed_id,  $current_bagian = 1)
    {
        // Cek apakah izin mic dan kamera sudah diberikan
        if (!$this->isMicAndCameraActive()) {
            return redirect()->to(base_url('user/dashboard'))->with('error', 'Harap mengizinkan akses kamera dan mikrofon');
        }

        // Mendapatkan semua data tes untuk pengguna saat ini
        $tests = $this->testModel
            ->where('id_user', $this->session->get('id_user'))
            ->findAll();

        // Mencari tes yang sesuai dengan hashed_id
        $test = null;
        foreach ($tests as $row) {
            if (hash('sha256', $row['id_test']) === $hashed_id) {
                $test = $row;
                break;
            }
        }

        // Jika tes ditemukan
        if ($test) {
            // Mengambil semua soal untuk tes
            $soalUjian = $this->soalujianModel
                ->select('soal.id_soal, soal.isi_soal, soal_ujian.id_soal_ujian, soal_ujian.jawaban_soal_ujian')
                ->join('soal', 'soal_ujian.id_soal = soal.id_soal')
                ->where('soal_ujian.id_test', $test['id_test'])
                ->like('soal.isi_soal', "bag{$current_bagian}_", 'after') // Mencari soal yang dimulai dengan "bag{current_bagian}_"
                ->whereNotIn('soal.isi_soal', [
                    'bag1_contoh soal.png',
                    'bag2_contoh soal.png',
                    'bag3_contoh soal.png',
                    'bag4_contoh soal.png'
                ]) // Mengecualikan soal tertentu yang mengandung nama file contoh soal
                ->findAll();

SELECT *
FROM `jawaban_soal`
WHERE `id_soal` = '19'
---

            // Mengambil semua jawaban untuk setiap soal
            foreach ($soalUjian as &$soalData) {
                $soalData['answers'] = $this->jawabanSoalModel
                    ->where('id_soal', $soalData['id_soal'])
                    ->findAll();

SELECT *
FROM `test`
---
    public function submit_test()
    {
        // Ambil data POST dari permintaan
        $postData = $this->request->getPost();
        $hashedIdTest = $postData['id_test'];

        // Inisialisasi variabel untuk menyimpan ID Test
        $idTest = null;

        // Ambil semua catatan test
        $testRecords = $this->testModel->findAll();

UPDATE `test` SET `status_test` = 'Selesai'
WHERE `id_test` = '1'
---
        }

        // Perbarui status_test pada tabel test
        $this->testModel->where('id_test', $idTest)
            ->set(['status_test' => 'Selesai']) // Perbaiki dengan menambahkan metode set
            ->update();