app/Controllers/User.php

    public function dashboard(): mixed
{
    $test = $this->testModel
        ->where('id_user', $this->session->get('id_user'))
        ->first();

    // Check if the test is available
    if ($test === null) {
        return redirect()->to(base_url('/logout'))->with('error', 'Tes Tidak Tersedia');
    }

    // Subquery to fetch distinct questions based on jenis_soal
    $subQuery = $this->db->table('soal')
        ->select('MIN(soal_ujian.id_soal_ujian) as id_soal_ujian')
        ->join('soal_ujian', 'soal.id_soal = soal_ujian.id_soal')
        ->where('soal_ujian.id_test', $test['id_test'])
        ->groupBy('soal.id_jenis_soal')
        ->getCompiledSelect();

    // Fetch detailed soal based on subquery
    $soal_ujian = $this->soalujianModel
        ->select('soal_ujian.*, soal.isi_soal, jenis_soal.nama_jenis_soal, jenis_soal.tipe_soal')
        ->join('soal', 'soal_ujian.id_soal = soal.id_soal')
        ->join('jenis_soal', 'soal.id_jenis_soal = jenis_soal.id_jenis_soal')
        ->where("soal_ujian.id_soal_ujian IN ($subQuery)", null, false)
        ->findAll();
---
SELECT *
FROM `test`
WHERE `id_user` = '7'
 LIMIT 1
SELECT `soal_ujian`.*, `soal`.`isi_soal`, `jenis_soal`.`nama_jenis_soal`, `jenis_soal`.`tipe_soal`
FROM `soal_ujian`
JOIN `soal` ON `soal_ujian`.`id_soal` = `soal`.`id_soal`
JOIN `jenis_soal` ON `soal`.`id_jenis_soal` = `jenis_soal`.`id_jenis_soal`
WHERE soal_ujian.id_soal_ujian IN (SELECT MIN(soal_ujian.id_soal_ujian) as id_soal_ujian
FROM `soal`
JOIN `soal_ujian` ON `soal`.`id_soal` = `soal_ujian`.`id_soal`
WHERE `soal_ujian`.`id_test` = '1'
GROUP BY `soal`.`id_jenis_soal`)